{"knowledge_content":"\n--- Source: LionLead 30-Day Leadership Onboarding Program ---\n﻿LionLead 30-Day Leadership Onboarding Program\r\n30-Day Program Outline by Week\r\nWeek 1: Identity Shift & Expectations (Days 1–7) – Focus on adjusting to a leadership mindset, building trust, and setting initial routines and expectations.\r\n- Day 1: Embracing Your New Role – Shifting from individual contributor to leader; understanding that your success is now through your team.\r\n- Day 2: Active Listening & Learning – Listening to your team and learning context before making big changes or decisions.\r\n- Day 3: Building Psychological Safety – Creating an environment where team members feel safe to speak up and make mistakes.\r\n- Day 4: Establishing Team Rituals – Setting up regular 1:1s and team meetings to maintain communication and alignment.\r\n- Day 5: Clarifying Expectations & Goals – Ensuring everyone understands their responsibilities and what success looks like.\r\n- Day 6: Avoiding Micromanagement – Trusting your team with tasks and resisting the urge to do or control everything yourself.\r\n- Day 7: End-of-Week Reflection – Reviewing what’s been learned in Week 1 and checking in on any questions or adjustments needed.\r\nWeek 2: Communication & Transparency (Days 8–14) – Focus on clear communication practices, sharing context, and fostering open dialogue.\r\n- Day 8: Asking Powerful Questions – Using open-ended questions to engage your team and understand their perspectives.\r\n- Day 9: Communicating with Clarity – Being clear and concise in your emails, meetings, and instructions to avoid confusion.\r\n- Day 10: Providing Context and Transparency – Sharing the “why” behind decisions (e.g. product vision or strategy) so the team sees the bigger picture.\r\n- Day 11: Managing Up & Across – Communicating effectively with your own manager and cross-functional peers (like Engineering, Design, etc.), keeping stakeholders informed.\r\n- Day 12: Inclusive Communication – Ensuring everyone on the team has a voice (drawing out quieter members and encouraging diverse opinions).\r\n- Day 13: Adapting to Different Styles – Recognizing different personality and work styles in your team and tailoring your approach for each individual.\r\n- Day 14: Communication Check-In – Verifying that your team feels informed; inviting feedback on your communication and addressing any misunderstandings.\r\nWeek 3: Feedback & Trust (Days 15–21) – Focus on giving and receiving feedback, building trust through honesty and consistency, and handling difficult conversations.\r\n- Day 15: Celebrating Wins – Acknowledging achievements and giving positive feedback to reinforce good work.\r\n- Day 16: Keeping Your Word – Building trust by following through on promises and being consistent in what you say and do.\r\n- Day 17: Constructive Feedback (Radical Candor) – Learning to give honest, kind feedback that helps team members improve (caring personally while challenging directly).\r\n- Day 18: Handling Difficult Conversations – Approaching tough issues (like performance problems) directly but empathetically, rather than avoiding them.\r\n- Day 19: Addressing Conflict Openly – Encouraging open resolution of conflicts or tensions on the team (bringing hidden issues to light and processing emotions calmly).\r\n- Day 20: Modeling Accountability – Taking responsibility for mistakes and demonstrating that it’s safe for others to admit errors and learn from them.\r\n- Day 21: Seeking Feedback from Others – Asking your team (and peers) for feedback on your leadership to show humility and continuously improve.\r\nWeek 4: Delegation, Priorities & Boundaries (Days 22–28) – Focus on empowering your team through delegation, setting priorities, and maintaining healthy boundaries to prevent burnout.\r\n- Day 22: The Power of Delegation – Understanding why you must delegate (you can’t do it all, and delegation develops your team’s skills).\r\n- Day 23: Effective Delegation – Identifying one task to delegate and doing it with clear instructions and trust (no micromanaging, just support).\r\n- Day 24: Empowering Decision-Making – Giving team members autonomy in decisions and showing you trust their judgment.\r\n- Day 25: Prioritizing What Matters – Helping the team focus on top priorities (and manage time/effort on what truly drives results).\r\n- Day 26: Saying “No” & Protecting Focus – Tactfully pushing back or negotiating deadlines when necessary to avoid overloading the team and maintain quality.\r\n- Day 27: Healthy Work-Life Boundaries – Encouraging a sustainable pace and respect for personal time (modeling this behavior yourself).\r\n- Day 28: Managing Stakeholders – Keeping stakeholders (senior leadership, other departments) informed and setting realistic expectations, so your team isn’t squeezed by surprises.\r\nDays 29–30: Reflection & Next Steps – Wrap up the first month by reflecting on progress and planning for continued growth.\r\n- Day 29: Reflection on Growth – Looking back on your first month as a leader, noting key lessons learned and how both you and the team have grown.\r\n- Day 30: Planning Forward – Setting goals for the next 30-60-90 days, identifying areas to continue developing, and celebrating the completion of your first month as a manager!\r\n________________\r\n\r\n\r\nDaily Content: Days 1–5\r\nDay 1 — Embracing Your New Role\r\nInsight: As a new manager, your success now comes from your team’s success — not just your own output. Embrace the mindset that you are a coach and guide, empowering others to do their best work.\r\nToday's Action: Schedule a one-on-one with each of your direct reports for this week. Use these introductory chats to listen and learn about their perspectives and needs.\r\nSuggested Script: “I’d love to hear your thoughts on what’s going well and what could be improved. I’m here to support you and learn how I can help.”\r\nReflection: What’s one thing you need to do differently in this leadership role compared to your previous role?\r\nDay 2 — Active Listening & Learning\r\nInsight: Great leaders listen more than they talk. By truly listening to your team, you’ll build trust and discover valuable insights about the people and the work.\r\nToday's Action: In your next one-on-one, practice active listening. Ask an open-ended question (for example, “What’s a challenge you’re facing right now?”), then stay quiet and let them share. Resist the urge to jump in — just listen and take notes.\r\nSuggested Script: “Thank you for sharing that. I appreciate your honesty, and I’m glad you told me.” (Use this to acknowledge what you heard and show you value their input.)\r\nReflection: What did you learn by listening that you might have missed if you had done all the talking?\r\nDay 3 — Building Psychological Safety\r\nInsight: Teams perform best when members feel safe to speak up and make mistakes. As a leader, your openness and reactions set this tone of psychological safety.\r\nToday's Action: Today, acknowledge something you don’t know or share a past mistake (and what you learned from it) with your team. Your small moment of vulnerability will signal that it’s okay for others to do the same.\r\nSuggested Script: “I don’t have all the answers here, and that’s okay. Let’s figure it out together. Feel free to share any idea — there are no bad suggestions.”\r\nReflection: What’s one sign that your team feels safe to speak up, and how could you encourage even more openness?\r\nDay 4 — Establishing Team Rituals\r\nInsight: Simple routines can help everyone stay connected and aligned. Regular check-ins like one-on-one meetings and team huddles create stability and ensure communication doesn’t fall through the cracks.\r\nToday's Action: If you haven’t already, set up a recurring one-on-one with each of your direct reports (weekly or bi-weekly). Also consider scheduling a short weekly team meeting to share updates or highlights. Let your team know the purpose of these meetings (for support, feedback, and alignment).\r\nSuggested Script: “I’d like to start a weekly 1:1 with you. It’s your dedicated time to discuss progress, roadblocks, or anything on your mind — and for me to support you.”\r\nReflection: How might regular 1:1s or team check-ins help prevent issues or miscommunications?\r\nDay 5 — Clarifying Expectations & Goals\r\nInsight: Clear expectations set everyone up for success. People feel more confident and accountable when they know what’s expected and how their work fits into the bigger picture.\r\nToday's Action: In a one-on-one, talk about expectations with a team member. Pick one key project and ask them to describe a successful outcome; then share your view and align on a clear goal or definition of “done.”\r\nSuggested Script: “To make sure we’re on the same page, what do you see as the goal for this project? Here’s what I’m expecting — let’s clarify any differences so we agree on the target.”\r\nReflection: Do your team members seem clear on their goals, and where could you clarify things further?\r\n________________\n"}